# Terminal & Shell
brew "starship"

# Editors
brew "helix"

# Terminal Emulators
cask "kitty"
cask "ghostty"

# File Manager
brew "yazi"

# Dev Tools
brew "gh"
brew "python"
brew "pipx"
brew "lazygit"
brew "jq"

# AI Coding Agent
brew "anomalyco/tap/opencode"

# Language Servers
brew "marksman"
brew "taplo"
brew "rust-analyzer"

# Modern CLI replacements
brew "eza"
brew "bat"
brew "fd"
brew "ripgrep"
brew "zoxide"
brew "fzf"
brew "git-delta"
brew "hyperfine"
brew "tokei"
brew "watchexec"

# iOS/Swift Development
brew "swiftformat"
brew "xcbeautify"
